# Rebar Shape Get Terminations Data Method

Source: https://www.revitapidocs.com/2026/3530f767-ccd7-7ab3-b9a3-845651926449.htm

---

| Rebar Shape Get Terminations Data Method |
| --- |

Gets the terminations (e.g. hook, crank) data.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public RebarShapeTerminationsData GetTerminationsData()
```

```
Public Function GetTerminationsData As RebarShapeTerminationsData
```

```
public:
RebarShapeTerminationsData^ GetTerminationsData()
```

```
member GetTerminationsData : unit -> RebarShapeTerminationsData
```

#### Return Value

RebarShapeTerminationsData
Returns the terminations (e.g. hook, crank) data. See Also

#### Reference

RebarShape Class Autodesk.Revit.DB.Structure Namespace